In [2]:
import numpy as np
import pandas as pd

INNER

In [3]:
registrations = pd.DataFrame({'reg_id': [1, 2, 3, 4], 
                              'name': ['Andrew', 'Bobo', 'claire', 'David']})
logins = pd.DataFrame({'log_id': ['1', '2', '3', '4'], 
                      'name': ['Xavier', 'Andrew', 'Yolanta', 'Bobo']})

In [4]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  claire
3       4   David

In [5]:
logins

  log_id     name
0      1   Xavier
1      2   Andrew
2      3  Yolanta
3      4     Bobo

In [6]:
pd.merge(registrations, logins, how='inner', on='name')

   reg_id    name log_id
0       1  Andrew      2
1       2    Bobo      4

LEFT_RIGHT

In [7]:
pd.merge(registrations, logins, how='left', on='name')

   reg_id    name log_id
0       1  Andrew      2
1       2    Bobo      4
2       3  claire    NaN
3       4   David    NaN

In [8]:
pd.merge(registrations, logins, how='right', on='name')

   reg_id     name log_id
0     NaN   Xavier      1
1     1.0   Andrew      2
2     NaN  Yolanta      3
3     2.0     Bobo      4

OUTER

In [9]:
pd.merge(registrations, logins, how='outer', on='name')

   reg_id     name log_id
0     1.0   Andrew      2
1     2.0     Bobo      4
2     4.0    David    NaN
3     NaN   Xavier      1
4     NaN  Yolanta      3
5     3.0   claire    NaN

In [10]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  claire
3       4   David

In [11]:
registrations = registrations.set_index('name')

In [12]:
registrations

        reg_id
name
Andrew       1
Bobo         2
claire       3
David        4

In [13]:
logins

  log_id     name
0      1   Xavier
1      2   Andrew
2      3  Yolanta
3      4     Bobo

In [14]:
pd.merge(registrations, logins, left_index=True, right_on='name', how='inner')

   reg_id log_id    name
1       1      2  Andrew
3       2      4    Bobo

In [15]:
registrations = registrations.reset_index()

In [16]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  claire       3
3   David       4

In [17]:
registrations.columns = ['reg_name', 'name']

In [18]:
registrations

  reg_name  name
0   Andrew     1
1     Bobo     2
2   claire     3
3    David     4

In [20]:
results = pd.merge(registrations, logins, how='inner', left_on='reg_name', right_on='name')

In [21]:
results.drop('reg_name', axis=1)

   name_x log_id  name_y
0       1      2  Andrew
1       2      4    Bobo

In [27]:
registrations.columns = ['name', 'id']

In [28]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  claire   3
3   David   4

In [29]:
logins.columns = ['id', 'name']

In [30]:
logins

  id     name
0  1   Xavier
1  2   Andrew
2  3  Yolanta
3  4     Bobo

In [32]:
pd.merge(registrations, logins, how='inner', on='name', suffixes=('_reg', '_log'))

     name  id_reg id_log
0  Andrew       1      2
1    Bobo       2      4